"""
Задание 1.

Напишите программу, которая запрашивает у пользователя два числа (целые или
с плавающей точкой), а затем выводит их сумму, разность, произведение и
частное
"""

n_1 = float(input())
n_2 = float(input())
print(n_1 + n_2, n_1 - n_2, n_1 * n_2, n_1 / n_2)